app/controllers/steps_controller.rb

SELECT * FROM "steps"
---
  def index
    @steps = Step.paginate_all_by_person_id(@user.id, :per_page => 30, :page => params[:page], :order => 'rec_date DESC')
    @step = Step.new

    @graph = open_flash_chart_object(800,400, "/step_graph.json")

    respond_to do |format|
      format.html # index.html.erb
      format.xml  { render :xml => @steps }
      format.csv do
        @steps = Step.find(:all, :conditions => ["person_id = ?", @user.id], :order => "rec_date");
        csv_string = FasterCSV.generate do |csv|
          # header row
          csv << ["rec_date", "steps", "mod_steps", "mod_min"]

          # data rows
          @steps.each do |s|

SELECT * FROM "steps" WHERE ("steps"."id" = 1)
---
  def show
    @step = Step.find(params[:id])

SELECT * FROM "steps" WHERE ("steps"."id" = 1)
---
  def edit
    @step = Step.find(params[:id])

INSERT INTO "steps" ("steps", "mod_steps", "created_at", "updated_at", "mod_min", "rec_date") VALUES(10, 5, '2009-08-03 17:41:45', '2009-08-03 17:41:45', 60, '2009-08-03')
---
  def create
    @step = Step.new(params[:step])

    respond_to do |format|
      if @step.save

SELECT * FROM "steps" WHERE ("steps"."id" = 1)
UPDATE "steps" SET "updated_at" = '2009-08-03 15:30:39', "mod_steps" = 15529, "rec_date" = '2009-08-02', "steps" = 16007 WHERE "id" = 1
---
  def update
    @step = Step.find(params[:id])

    respond_to do |format|
      if @step.update_attributes(params[:step])