app/controllers/weights_controller.rb

SELECT * FROM "weights"
---
  def index
    @weight = Weight.new # new empty weight if user wants to create a new record


    respond_to do |format|
      format.html do
        @graph = graph_code( 2.months.ago, '800x300' )
        @weights = Weight.paginate_all_by_person_id(@user.id, :per_page=>15, :page => params[:page], :order => 'rec_date DESC')
      end
      format.mobile do
        @graph = graph_code( 7.days.ago, '800x300' )
        @weights = Weight.paginate_all_by_person_id(@user.id, :per_page=>5, :page => params[:page], :order => 'rec_date DESC')
      end
      format.xml  { render :xml => @weights }
      format.csv do
        @weights = Weight.find(:all, :conditions => ["person_id = ?", @user.id])   # get all the weights, not just this page

        csv_string = CSV.generate do |csv|
          # header row
          csv << ["rec_date", "weight", "avg_weight", "bodyfat"]

          #data rows
          @weights.each do |s|

SELECT * FROM "weights" WHERE ("weights"."id" = 1)
---
  def show
    @weight = Weight.find(params[:id])

SELECT * FROM "weights" WHERE ("weights"."id" = 4)
---
  def edit
    @weight = Weight.find(params[:id])

INSERT INTO "weights" ("created_at", "updated_at", "weight", "rec_date") VALUES('2009-08-12 23:55:45', '2009-08-12 23:55:45', 191.4, '2009-08-12')
---
  def create
    @weight = Weight.new(params[:weight])
    @weight.calc_avg_weight



    respond_to do |format|
      if @weight.save

SELECT * FROM "weights" WHERE ("weights"."id" = 3)
DELETE FROM "weights" WHERE "id" = 3
---
  def destroy
    @weight = Weight.find(params[:id])
    @weight.destroy

INSERT INTO "weights" ("created_at", "updated_at", "weight", "rec_date") VALUES('2009-08-13 00:26:31', '2009-08-13 00:26:31', 100.0, '2009-01-01')
---
  def csv_import
    @parsed_file=CSV.parse(params[:dump][:file])
    n=0
    @parsed_file.each  do |row|
      c=Weight.new
      c.rec_date=row[0]
      c.weight=row[1]
      c.bodyfat=row[3]
      c.person_id = @user.id

      if c.save